##########################################################
######################### TAPS ###########################
##########################################################

tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"
tap "go-task/tap"

##########################################################
####################### UTILITIES ########################
##########################################################

brew "asdf"
brew "bat"
brew "ca-certificates"
brew "checkov"
brew "curl"
brew "direnv"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glances"
brew "gnupg"
brew "go"
brew "go-task/tap/go-task"
brew "grep"
brew "helm"
brew "htop"
brew "hugo"
brew "jq"
brew "k9s"
brew "libomp"
brew "make"
brew "nano"
brew "neovim"
brew "node"
brew "nvm"
brew "openjdk"
brew "pipx"
brew "ripgrep"
brew "sops"
brew "hashicorp/tap/terraform"
brew "terragrunt"
brew "thefuck"
brew "tree"
brew "wget"
brew "yq"

##########################################################
######################### CASKS ##########################
##########################################################

cask "1password"
cask "amazon-q"
cask "caffeine"
cask "cyberduck"
cask "docker"
cask "elgato-stream-deck"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "jetbrains-toolbox"
cask "lens"
cask "logi-options+"
cask "ollama"
cask "slack"
cask "spotify"
cask "syntax-highlight", args: { no_quarantine: true }
cask "visual-studio-code"
cask "vlc"
cask "zoom"

##########################################################
######################### FONTS ##########################
##########################################################

cask "font-fontawesome"
cask "font-meslo-lg-nerd-font"

##########################################################
#################### PYTHON + PYENV ######################
##########################################################

brew "openssl"
brew "readline"
brew "sqlite3"
brew "tcl-tk"
brew "xz"
brew "zlib"
